# Задание 1
# Выяснить тип результата выражений:
# 15 * 3
# 15 / 3
# 15 // 2
# 15 ** 2

print("Тип результата 15 * 3 это " + str(type(15 * 3)))
print("Тип результата 15 / 3 это %s" % str(type(15 / 3)))
print("Тип результата 15 // 2 это {}".format(str(type(15 // 2))))
print(f"Тип результата 15 ** 2 это {str(type(15 ** 2))}")

# Нужно переучиться после php чтобы не использовать громоздкую конструкцию, по этому использовал все варианты вывода строки, какие перечислены в методичке
